Repository: efestotech/sparks
Catalog: docs/locales/*/LC_MESSAGES/api.po
Languages: it

source: API Documentation
it: Documentazione API

source: The SPARKS Forge allows integration with external systems via a simple REST interface.
it: La Fucina di SPARKS permette l'integrazione con sistemi esterni tramite una semplice interfaccia REST.

source: Authentication
it: Autenticazione

source: All API requests must include your API Key in the HTTP header:
it: Tutte le richieste API devono includere la tua Chiave API (API Key) nell'header HTTP:

source: `X-API-KEY: your_api_key`
it: `X-API-KEY: la_tua_chiave_api`

source: You can find API keys in the "Guardians" section of the Citadel.
it: Puoi trovare le chiavi API nella sezione "Guardiani" della Cittadella.

source: Endpoint: Send Email (V1)
it: Endpoint: Invio Email (V1)

source: To add an email to the forge's queue, send a POST request.
it: Per aggiungere un'email alla coda della fucina, invia una richiesta POST.

source: **URL**: `http://your-domain.com/api/v1/send`
it: **URL**: `http://tuo-dominio.com/api/v1/send`

source: **Method**: `POST`
it: **Metodo**: `POST`

source: **Format**: `application/json`
it: **Formato**: `application/json`

source: ======= ======== ======== ============================================================= Field Type Required Description ======= ======== ======== ============================================================= to_email string Yes Email of the recipient. to_name string No Name of the recipient. subject string Yes Subject of the message. body_html string Yes HTML or text content of the message. priority int No Priority (1: High, 5: Medium, 9: Low). Default: 5 scheduled_at string No Optional. ISO Date (Y-m-d H:i:s) for future delivery. ======= ======== ======== =============================================================
it: ======= ======== ======== ============================================================= Campo Tipo Obblig. Descrizione ======= ======== ======== ============================================================= to_email string Sì Email del destinatario. to_name string No Nome del destinatario. subject string Sì Oggetto del messaggio. body_html string Sì Contenuto HTML o testo del messaggio. priority int No Priorità (1: Alta, 5: Media, 9: Bassa). Default: 5 scheduled_at string No Opzionale. Data ISO (Y-m-d H:i:s) per invio futuro. ======= ======== ======== =============================================================

source: **Example Request:**
it: **Esempio di Richiesta:**

source: .. code-block:: json { "to_email": "recipient@example.com", "to_name": "Marco Spinelli", "subject": "Welcome to the Forge", "body_html": "<h1>Hello Marco!</h1><p>Your spark is ready.</p>", "priority": 1, "scheduled_at": "2026-02-25 15:30:00" }
it: .. code-block:: json { "to_email": "destinatario@esempio.com", "to_name": "Marco Spinelli", "subject": "Benvenuto nella Fucina", "body_html": "<h1>Ciao Marco!</h1><p-Your spark is ready.</p>", "priority": 1, "scheduled_at": "2026-02-25 15:30:00" }

source: **Example Response (Success):**
it: **Esempio di Risposta (Successo):**

source: Response Considerations
it: Considerazioni sulle Risposte

source: **200 OK**: If the message was successfully added to the queue.
it: **200 OK**: Se il messaggio è stato aggiunto correttamente alla coda.

source: **401 Unauthorized**: If the API key is missing or incorrect.
it: **401 Unauthorized**: Se la chiave API è mancante o non corretta.

source: **400 Bad Request**: If mandatory fields are missing or data is invalid.
it: **400 Bad Request**: Se mancano i campi obbligatori o i dati non sono validi.

source: The actual sending of emails depends on the execution of the Worker's Cron Job. The API is limited to adding the message to the internal queue (The Hearth).
it: L'invio effettivo delle email dipende dall'esecuzione del Cron Job del Worker. L'API si limita ad aggiungere il messaggio alla coda interna (Il Focolare).
