Repository: efestotech/sparks
Catalog: docs/locales/*/LC_MESSAGES/features.po
Languages: it

source: Features of the Forge
it: Caratteristiche della Fucina

source: SPARKS is not a simple sending system; it is a work of mythological engineering.
it: SPARKS non è un semplice sistema di invio, è un'opera d'ingegneria mitologica.

source: Multiple SMTP Management (The Anvils)
it: Gestione SMTP Multipla (Le Incudini)

source: **Intelligent Rotation**: The system rotates through different SMTP servers to maximize delivery and respect limits.
it: **Rotazione Intelligente**: Il sistema ruota tra diversi server SMTP per massimizzare la consegna e rispettare i limiti.

source: **Hourly and Daily Limits**: Each "Anvil" has its own configurable limits to avoid bans and overloads.
it: **Limiti Orari e Giornalieri**: Ogni "Incudine" ha i propri limiti configurabili per evitare ban e sovraccarichi.

source: **Connection Pooling**: The system keeps connections active to speed up the sending of large quantities of sparks.
it: **Pooling delle Connessioni**: Il sistema mantiene le connessioni attive per velocizzare l'invio di grandi quantità di scintille.

source: **Personal Sender Identity**: Each server can have its own sender name and email.
it: **Identità del Mittente Personale**: Ogni server può avere il proprio nome e email del mittente.

source: Sending Queue (The Hearth)
it: Coda di Invio (Il Focolare)

source: **Priority Management**: Sends critical messages before standard notifications.
it: **Gestione Priorità**: Invia i messaggi critici prima delle notifiche standard.

source: **Scheduled Sending**: Ability to specify a future date and time for automatic delivery.
it: **Invio Programmato**: Possibilità di specificare data e ora future per la consegna automatica.

source: **Automatic Retries**: If a sent fails, the system retries according to the configuration (default: 3 retries).
it: **Tentativi Automatici**: Se un'invio fallisce, il sistema riprova secondo la configurazione (default: 3 tentativi).

source: **Detailed Logging**: Every event is recorded with the original SMTP error codes for rapid debugging.
it: **Logging Dettagliato**: Ogni evento viene registrato con i codici di errore SMTP originali per un debug rapido.

source: Administrative Interface (The Citadel)
it: Interfaccia Amministrativa (La Cittadella)

source: **Premium Design**: An interface inspired by Greek mythology, elegant and modern.
it: **Design Premium**: Un'interfaccia ispirata alla mitologia greca, elegante e moderna.

source: **Native Multilingual**: Full support for Italian and English, with automatic language detection.
it: **Multilingua Nativo**: Supporto completo per Italiano e Inglese, con rilevamento automatico della lingua.

source: **Real-time Dashboard**: View the status of embers and anvils at a glance.
it: **Dashboard Real-time**: Visualizza lo stato delle braci e delle incudini a colpo d'occhio.

source: **Guardian Management**: Manage different administrative accounts with individual API keys.
it: **Gestione Guardiani**: Gestisci diversi account amministrativi con chiavi API individuali.

source: Aegis Security
it: Sicurezza dell'Egida

source: **Password Encryption**: SMTP passwords are encrypted in the database using AES-256.
it: **Crittografia Password**: Le password SMTP sono criptate nel database utilizzando AES-256.

source: **Worker Security**: Worker execution is protected by a configurable Secret Sigil (Secret Key).
it: **Sicurezza Worker**: L'esecuzione del worker è protetta da un Sigillo Segreto (Secret Key) configurabile.

source: **API Isolation**: External access is only allowed through regenerable API keys.
it: **Isolamento API**: L'accesso esterno è permesso solo tramite chiavi API rigenerabili.
