Repository: efestotech/sparks
Catalog: docs/locales/*/LC_MESSAGES/installation.po
Languages: it

source: Installation and Configuration
it: Installazione e Configurazione

source: Follow these steps to erect your SPARKS Forge.
it: Segui questi passi per erigere la tua Fucina SPARKS.

source: 1. File Upload
it: 1. Caricamento dei File

source: Copy all the files from the project folder to the main directory of your web server (e.g., `public_html`, `www`, or a dedicated subfolder).
it: Copia tutti i file della cartella del progetto nella directory principale del tuo web server (es. `public_html`, `www`, o una sottocartella dedicata).

source: 2. The Setup Wizard (Recommended)
it: 2. Il Setup Wizard (Raccomandato)

source: SPARKS comes with an intuitive setup wizard to automate the configuration.
it: SPARKS include un wizard di installazione intuitivo per automatizzare la configurazione.

source: Navigate to: `http://your-domain.com/setup.php`
it: Vai a: `http://tuo-dominio.com/setup.php`

source: **The Citadel Boundary**: Enter your Base URL (e.g., `http://sparks.it/`).
it: **The Citadel Boundary**: Inserisci il tuo URL Base (es. `http://sparks.it/`).

source: **The Vault of Hephaestus**: Provide your MySQL/MariaDB database credentials (Hostname, Name, Username, Password).
it: **The Vault of Hephaestus**: Fornisci le credenziali del database MySQL/MariaDB (Hostname, Nome, Username, Password).

source: **The Master Blacksmith**: Create your first Guardian (Admin) account.
it: **The Master Blacksmith**: Crea il tuo primo account Guardiano (Admin).

source: **Forge Protection**: A Worker Sigil (Secret Key) is automatically generated. Keep this safe!
it: **Forge Protection**: Un Sigillo del Worker (Secret Key) viene generato automaticamente. Tienilo al sicuro!

source: Click **Strike the Anvil & Begin**.
it: Clicca su **Strike the Anvil & Begin**.

source: The system will: * Test the database connection. * Generate a secure encryption key for SMTP passwords. * Create the `.env` file automatically. * Initialize the database schema and default settings. * **Self-destruct**: The `setup.php` script is automatically deleted for security once finished.
it: Il sistema provvederà a: * Testare la connessione al database. * Generare una chiave di crittografia sicura per le password SMTP. * Creare automaticamente il file `.env`. * Inizializzare lo schema del database e le impostazioni predefinite. * **Autodistruzione**: Il file `setup.php` viene eliminato automaticamente per sicurezza una volta terminato.

source: 3. Manual Configuration (Alternative)
it: 3. Configurazione Manuale (Alternativa)

source: If you prefer manual setup, rename the `.env.example` file to `.env` in the project root and configure the following parameters:
it: Se preferisci l'installazione manuale, rinomina il file `.env.example` in `.env` nella radice del progetto e configura i seguenti parametri:

source: 4. Cron Job Configuration (The Automatic Bellows)
it: 4. Configurazione del Cron Job (Il Mantice Automatico)

source: To ensure emails are sent automatically, you must set up a Cron Job on your server that calls the `worker.php` file periodically.
it: Per far sì che le email vengano inviate automaticamente, devi impostare un Cron Job sul tuo server che richiami il file `worker.php` periodicamente.

source: Example (Execution every minute):
it: Esempio (Esecuzione ogni minuto):

source: Alternatively, you can ignite the bellows manually from the Admin Dashboard.
it: Alternativamente, puoi azionare il mantice manualmente dalla Dashboard di Amministrazione.

source: 5. Accessing the Citadel
it: 5. Accesso alla Cittadella

source: After the setup is complete, access the administrative area at:
it: Una volta completata la configurazione, accedi all'area amministrativa all'indirizzo:

source: `http://your-domain.com/admin`
it: `http://tuo-dominio.com/admin`

source: The default credentials are those you provided during the Setup Wizard.
it: Le credenziali predefinite sono quelle fornite durante il Setup Wizard.
