Repository: efestotech/sparks
Catalog: docs/locales/*/LC_MESSAGES/requirements.po
Languages: it

source: System Requirements
it: Requisiti di Sistema

source: To run the Forge of SPARKS, your environment must meet the following divine criteria:
it: Per far funzionare la Fucina di SPARKS, il tuo ambiente deve soddisfare i seguenti criteri divini:

source: Server Environment
it: Ambiente Server

source: **PHP**: Version 8.1 or higher.
it: **PHP**: Versione 8.1 o superiore.

source: **Database**: MySQL 5.7+ or MariaDB 10.3+.
it: **Database**: MySQL 5.7+ o MariaDB 10.3+.

source: **Web Server**: Apache with `mod_rewrite` enabled or Nginx.
it: **Web Server**: Apache con `mod_rewrite` abilitato o Nginx.

source: **Composer**: For managing dependencies (optional for manual installation).
it: **Composer**: Per la gestione delle dipendenze (opzionale per l'installazione manuale).

source: Required PHP Extensions
it: Estensioni PHP Richieste

source: The system requires the following extensions to be enabled in your `php.ini`:
it: Il sistema richiede le seguenti estensioni abilitate nel tuo `php.ini`:

source: `intl`: For localization and multi-language messages.
it: `intl`: Per la localizzazione e i messaggi multilingua.

source: `mbstring`: For safe multibyte text handling.
it: `mbstring`: Per la gestione sicura del testo multibyte.

source: `mysqli`: For database communication.
it: `mysqli`: Per la comunicazione con il database.

source: `curl`: For external notifications (if used).
it: `curl`: Per le notifiche esterne (se utilizzate).

source: `openssl`: For encrypting Secret Sigils (SMTP passwords).
it: `openssl`: Per la crittografia dei Sigilli Segreti (SMTP password).

source: Resource Limits
it: Limiti Risorse

source: **Memory**: At least 128MB of RAM dedicated to PHP.
it: **Memoria**: Almeno 128MB di RAM dedicati a PHP.

source: **Permissions**: The `writable/` folder must be writable by the web server.
it: **Permessi**: La cartella `writable/` deve essere scrivibile dal web server.
